src/cf/DataProcessors/ЗаполнениеГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеГрафика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ЗаполнениеГрафика/Ext/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Запись.График = График;
		Запись.Значение = 24;
		Дат = Дат + 3 * ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
	
КонецПроцедуры
